Feature: Оформлення замовлення незалогованим користувачем
  Як незалогований користувач
  Я хочу спробувати оформити замовлення
  Щоб перевірити що система перенаправляє на сторінку входу

  Scenario: Незалогований користувач не може оформити замовлення
    Given Я відкриваю головну сторінку
    When Я клікаю на перший товар зі списку
    And Я натискаю кнопку "Add to cart"
    And Я переходжу до кошика
    And Я натискаю кнопку "Оформити замовлення"
    Then Зявляється форма для входу в акаунт
