Feature: Оформлення замовлення незалогованим користувачем
  Як незалогований користувач
  Я хочу спробувати оформити замовлення
  Щоб перевірити що система перенаправляє на сторінку входу

  Scenario: Незалогований користувач не може оформити замовлення
    Given Я відкриваю головну сторінку
    When Я натискаю на "first element"
    And Я знаходжуся на сторінці "product"
    When Я натискаю на "add to cart"
    When Я натискаю на "cart"
    And Я знаходжуся на сторінці "checkout"
    And Я натискаю на "proceed to checkout"
    Then Зявляється форма для входу в акаунт
